000100170929      *^   TEST1P - (Prototypes for TEST1M)
000101170929      *^
000102170929      *^  ************************** Change Log ***************************
000103170929      *^  Project ID  Pgmr   Date       Project Description
000104170929      *^   TEST       ADO    29/09/17   New
000105170929      *^  ************************** Change Log ***************************
000106170929
000107170929         // *****************************************************************
000108170929         //Structure templates:
000109170929         // *****************************************************************
000125171005
000126170929         /If Defined (TEST1_TMP)
000127170929           dcl-ds test_p qualified template;
000128170929             test_xyz zoned (7:0);
000129170929           end-ds;
000130170929         /ENDIF
000131170929
000132170929         // *****************************************************************
000133171006         // function prototypes:
000134170929         // *****************************************************************
000135170929
000136170929         /If Defined (TEST1_FUN)
000137170929           dcl-pr TEST_FUNCTION ind;
000138170929             test_in char(26) const;
000139170929             test_out likeds(test_p);
000140170929           end-pr;
000141170929         /ENDIF
