000100171005      /title TEST MODULE
000101171005      //***********************************************************************
000102171005      // TEST1     funkcje test
000103171005      //************************************************************************
000104171005      // ************************* Change Log **********************************
000105171005      // Project ID   Pgmr   Date        Project Description
000106171005      // -----------  ----  ----------   ---------------------------------------
000107171005      // TEST         ADO   2017/09/29   Create member
000108171005      // -----------  ----  ----------   ---------------------------------------
000109171005      //************************************************************************
000110171006        ctl-opt nomain debug(*yes);
000111171005
000112171005
000113170929      /DEFINE TEST1_TMP
000114170929      /DEFINE TEST1_FUN
000116170929      /COPY TESTSOURCE,TEST1P
000117170929
000118170929       dcl-proc TEST_FUNCTION export;
000119170929         dcl-pi *n ind;
000120170929          test_in char(26) const;
000121170929          test_out likeds(test_p);
000122170929         end-pi;
000123170929
000124170929         dcl-s var_1 packed(3:0);
000126171006           var_1 = %INT(test_in);
000127170929
000128170929           return *on;
000129170929       end-proc;
